import random
print('Магический шар')
answers = ['Бесспорно', 'Предрешено', 'Никаких сомнений', 'Определённо да', 'Определённо да', 'Модешь быть уверен в этом',
           'Мне кажется - да', 'Вероятнее всего', 'Хорошие перспективы', 'Знаки говорят - да', 'Да', 'Пока неясно, попробуй снова',
           'Спроси позже', 'Лучше не рассказывать', 'Сейчас нельзя предсказать', 'Сконцентрируйся и спроси опять', 'Даже не думай',
           'Мой ответ - нет', 'По моим данным - нет', 'Перспективы не очень хорошие', 'Весьма сомнительно']

print('Привет Мир, я магический шар, и я знаю ответ на любой твой вопрос.')
name = input('Как тебя зовут? Введите ваше имя: ')
print(f'Привет {name}')

while True:
    input('Задай вопрос: ')
    print(random.choice(answers))

    if input('Хочешь задать еще вопрос? (да/нет): ') == 'нет':
        print('Возвращайся, если возникнут вопросы')
        break
